<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class QuestionsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('questions')->delete();
        
        \DB::table('questions')->insert(array (
            0 => 
            array (
                'id' => 1,
                'question' => 'واضرب لهم مثلا أصحاب القرية اذ جاءها المرسلون',
                'name' => 'سورة يسن',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            1 => 
            array (
                'id' => 2,
                'question' => 'قال تعالي : وَلَوْ يُؤَاخِذُ اللَّهُ النَّاسَ بِمَا كَسَبُوا مَا تَرَكَ عَلَى ظَهْرِهَا مِن دَابَّةٍ وَلَكِن يُؤَخِّرُهُمْ إِلَى أَجَلٍ مُّسَمًّى فَإِذَا جَاءَ أَجَلُهُمْ فَإِنَّ اللَّهَ كَانَ بِعِبَادِهِ بَصِيرًا. ماهيا اسم السورة التي ذكرت بها الايه؟',
                'name' => 'سورة فاطر',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            2 => 
            array (
                'id' => 3,
                'question' => 'وَلَقَدْ كَانُوا عَاهَدُوا اللَّهَ مِن قَبْلُ لا يُوَلُّونَ الأَدْبَارَ وَكَانَ عَهْدُ اللَّهِ مَسْؤُولا',
                'name' => 'سورة الاحزاب',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            3 => 
            array (
                'id' => 4,
                'question' => 'وان من شيعته لابراهيم',
                'name' => 'سورة الصافات',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            4 => 
            array (
                'id' => 5,
                'question' => 'سُبْحَانَ اللَّهِ عَمَّا يَصِفُونَ',
                'name' => 'سورة الصافات',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            5 => 
            array (
                'id' => 6,
                'question' => 'وهل أتاك نبأ الخصم إذ تسوروا المحراب',
                'name' => 'سورة ص',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            6 => 
            array (
                'id' => 7,
                'question' => 'ولقد فتنا سليمان والقينا على كرسيه جسدا ثم أناب',
                'name' => 'سورة ص',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            7 => 
            array (
                'id' => 8,
                'question' => 'فَمَنْ أَظْلَمُ مِمَّنْ كَذَبَ عَلَى اللَّهِ وَكَذَّبَ بِالصِّدْقِ إِذْ جَاءَهُ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْكَافِرِينَ',
                'name' => 'سورة الزمر',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            8 => 
            array (
                'id' => 9,
                'question' => 'وَمَنْ أَظْلَمُ مِمَّن ذُكِّرَ بِآيَاتِ رَبِّهِ ثُمَّ أَعْرَضَ عَنْهَا إِنَّا مِنَ الْمُجْرِمِينَ مُنتَقِمُونَ',
                'name' => 'سورة السجده',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            9 => 
            array (
                'id' => 10,
                'question' => 'أُوْلَئِكَ عَلَى هُدًى مِّن رَّبِّهِمْ وَأُولَئِكَ هُمُ الْمُفْلِحُونَ',
                'name' => 'سورة لقمان',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            10 => 
            array (
                'id' => 11,
                'question' => 'فادعوا الله مخلصين له الدين ولو كره الكافرون',
                'name' => 'سورة غافر',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            11 => 
            array (
                'id' => 12,
                'question' => 'قال تعالي:فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ وَلا يَسْتَخِفَّنَّكَ الَّذِينَ لا يُوقِنُونَ
ماهو اسم السوره التي ذكرت بها الايه؟',
                'name' => 'سورة الروم',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            12 => 
            array (
                'id' => 13,
                'question' => 'إن الذين آمنوا وعملوا الصالحات لهم أجر غير ممنون',
                'name' => 'سورة فصلت ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            13 => 
            array (
                'id' => 14,
                'question' => 'وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ فَاخْتُلِفَ فِيهِ وَلَوْلا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ لَقُضِيَ بَيْنَهُمْ وَإِنَّهُمْ لَفِي شَكٍّ مِّنْهُ مُرِيبٍ',
                'name' => 'سورة فصلت ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            14 => 
            array (
                'id' => 15,
                'question' => 'قال عالي:شَرَعَ لَكُم مِّنَ الدِّينِ مَا وَصَّى بِهِ نُوحًا وَالَّذِي أَوْحَيْنَا إِلَيْكَ وَمَا وَصَّيْنَا بِهِ إِبْرَاهِيمَ وَمُوسَى وَعِيسَى أَنْ أَقِيمُوا الدِّينَ وَلا تَتَفَرَّقُوا فِيهِ كَبُرَ. ماهو اسم السوره التي ذكرت بها الايه؟',
                'name' => 'سورة الشوري',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            15 => 
            array (
                'id' => 16,
                'question' => 'وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ وَلَكِنْ يُنَزِّلُ بِقَدَرٍ مَا يَشَاءُ 
إِنَّهُ بِعِبَادِهِ خَبِيرٌ بَصِيرٌ',
                'name' => 'سورة الشوري',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            16 => 
            array (
                'id' => 17,
                'question' => 'واذ قال ابراهيم لابيه وقومه إنني براء مما تعبدون',
                'name' => 'سورة الزخرف',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            17 => 
            array (
                'id' => 18,
                'question' => 'وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ فَأَنَّى يُؤْفَكُونَ',
                'name' => 'سورة الزخرف',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            18 => 
            array (
                'id' => 19,
                'question' => 'مَن ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضًا حَسَنًا فَيُضَاعِفَهُ لَهُ وَلَهُ أَجْرٌ كَرِيمٌ',
                'name' => 'سورة الدخان',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            19 => 
            array (
                'id' => 20,
                'question' => 'ان المتقين فى مقام امين',
                'name' => 'سورة الدخان',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            20 => 
            array (
                'id' => 21,
                'question' => 'قُل لِّلَّذِينَ آمَنُوا يَغْفِرُوا لِلَّذِينَ لا يَرْجُون أَيَّامَ اللَّهِ لِيَجْزِيَ قَوْمًا بِمَا كَانُوا يَكْسِبُونَ',
                'name' => 'سورة الجاثية',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            21 => 
            array (
                'id' => 22,
                'question' => 'ولله ملك السماوات والأرض ويوم تقوم الساعة يومئذ يخسر المبطلون',
                'name' => 'سورة الجاثية',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            22 => 
            array (
                'id' => 23,
                'question' => 'مَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ وَأَجَلٍ مُسَمًّى وَالَّذِينَ كَفَرُوا عَمَّا أُنْذِرُوا مُعْرِضُونَ ',
                'name' => 'سورة الأحقاف',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            23 => 
            array (
                'id' => 24,
                'question' => 'وَاذْكُرْ أَخَا عَادٍ إِذْ أَنذَرَ قَوْمَهُ بِالْأَحْقَافِ وَقَدْ خَلَتِ النُّذُرُ مِن بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ أَلَّا تَعْبُدُوا إِلَّا اللَّهَ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ',
                'name' => 'سورة الأحقاف',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            24 => 
            array (
                'id' => 25,
                'question' => 'ذلك بأن الله مولى الذين آمنوا وأن الكافرين لا مولى لهم',
                'name' => 'سورة محمد',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            25 => 
            array (
                'id' => 26,
                'question' => 'ان الذين كفروا وصدوا عن سبيل الله ثم ماتوا وهم كفار فلن يغفر الله لهم',
                'name' => 'سورة محمد',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            26 => 
            array (
                'id' => 27,
                'question' => 'ولله جنود السماوات والأرض وكان الله عزيزا حكيما',
                'name' => 'سورة الفتح',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            27 => 
            array (
                'id' => 28,
                'question' => 'وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ يَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا',
                'name' => 'سورة الفتح',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            28 => 
            array (
                'id' => 29,
                'question' => 'لَقَدْ صَدَقَ اللَّهُ رَسُولَهُ الرُّؤْيَا بِالْحَقِّ لَتَدْخُلُنَّ الْمَسْجِدَ الْحَرَامَ إِن شَاء اللَّهُ آمِنِينَ مُحَلِّقِينَ رُؤُوسَكُمْ وَمُقَصِّرِينَ لا تَخَافُونَ فَعَلِمَ مَا لَمْ تَعْلَمُوا فَجَعَلَ مِن دُونِ ذَلِكَ فَتْحًا قَرِيبًا',
                'name' => 'سورة الفتح',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            29 => 
            array (
                'id' => 30,
                'question' => 'يَا أَيُّهَا الَّذِينَ آمَنُوا إِن جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا أَن تُصِيبُوا قَوْمًا بِجَهَالَةٍ فَتُصْبِحُوا عَلَى مَا فَعَلْتُمْ نَادِمِينَ',
                'name' => 'سورة الحجرات',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            30 => 
            array (
                'id' => 31,
                'question' => 'قَالَتِ الْأَعْرَابُ آَمَنَّا قُلْ لَمْ تُؤْمِنُوا وَلَكِنْ قُولُوا أَسْلَمْنَا وَلَمَّا يَدْخُلِ الْإِيمَانُ فِي قُلُوبِكُمْ 
وَإِنْ تُطِيعُوا اللَّهَ وَرَسُولَهُ لَا يَلِتْكُمْ مِنْ أَعْمَالِكُمْ شَيْئًا إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ
',
                'name' => 'سورة الحجرات',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            31 => 
            array (
                'id' => 32,
                'question' => 'بَلْ كَذَّبُوا بِالْحَقِّ لَمَّا جَاءَهُمْ فَهُمْ فِي أَمْرٍ مَّرِيجٍ',
                'name' => 'سورة ق',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            32 => 
            array (
                'id' => 33,
                'question' => 'إن في ذلك لذكرى لمن كان له قلب أو ألقى السمع وهو شهيد',
                'name' => 'سورة ق',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            33 => 
            array (
                'id' => 34,
                'question' => 'ان المتقين فى جنات وعيون',
                'name' => 'سورة الذريات',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            34 => 
            array (
                'id' => 35,
                'question' => 'وذكر فإن الذكرى تنفع المؤمنين',
                'name' => 'سورة الذريات',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            35 => 
            array (
                'id' => 36,
                'question' => 'ان المتقين فى جنات ونعيم',
                'name' => 'سورة الطور',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            36 => 
            array (
                'id' => 37,
                'question' => 'ويطوف عليهم غلمان كانهم لؤلؤ مكنون',
                'name' => 'سورة الطور',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            37 => 
            array (
                'id' => 38,
                'question' => ' إن الذين لا يؤمنون بالآخرة ليسمون الملائكة تسمية الأنثى',
                'name' => 'سورة النجم',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            38 => 
            array (
                'id' => 39,
                'question' => 'وأن ليس للإنسان إلا ماسعى',
                'name' => 'سورة النجم',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            39 => 
            array (
                'id' => 40,
                'question' => 'كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ فَكَذَّبُوا عَبْدَنَا وَقَالُوا مَجْنُونٌ وَازْدُجِرَ',
                'name' => 'سورة القمر',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            40 => 
            array (
                'id' => 41,
                'question' => 'كذبت ثمود بالنذر',
                'name' => 'سورة القمر',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            41 => 
            array (
                'id' => 42,
                'question' => 'إن المجرمين في ضلال وسعر',
                'name' => 'سورة القمر',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            42 => 
            array (
                'id' => 43,
                'question' => 'بَيْنَهُمَا بَرْزَخٌ لّا يَبْغِيَانِ.فَبِأَيِّ آلاء رَبِّكُمَا تُكَذِّبَانِ',
                'name' => 'سورة الرحمن',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            43 => 
            array (
                'id' => 44,
                'question' => 'هل جزاء الإحسان إلا الإحسان. فَبِأَيِّ آَلَاءِ رَبِّكُمَا تُكَذِّبَانِ ',
                'name' => 'سورة الرحمن',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            44 => 
            array (
                'id' => 45,
                'question' => 'وأصحاب اليمين ما أصحاب اليمين',
                'name' => 'سورة الواقعة',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            45 => 
            array (
                'id' => 46,
                'question' => 'فلا أقسم بمواقع النجوم.وَإِنَّهُ لَقَسَمٌ لَوْ تَعْلَمُونَ عَظِيمٌ ',
                'name' => 'سورة الواقعة',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            46 => 
            array (
                'id' => 47,
                'question' => 'سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ',
                'name' => 'سورة الحديد ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            47 => 
            array (
                'id' => 48,
                'question' => 'فَالْيَوْمَ لا يُؤْخَذُ مِنكُمْ فِدْيَةٌ وَلا مِنَ الَّذِينَ كَفَرُوا مَأْوَاكُمُ النَّارُ هِيَ مَوْلاكُمْ وَبِئْسَ الْمَصِيرُ',
                'name' => 'سورة الحديد ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            48 => 
            array (
                'id' => 49,
                'question' => 'وَلَقَدْ أَرْسَلْنَا نُوحًا وَإِبْرَاهِيمَ وَجَعَلْنَا فِي ذُرِّيَّتِهِمَا النُّبُوَّةَ وَالْكِتَابَ 
فَمِنْهُمْ مُهْتَدٍ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ
',
                'name' => 'سورة الحديد ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            49 => 
            array (
                'id' => 50,
                'question' => 'إِنَّ الَّذِينَ يُحَادُّونَ اللَّهَ وَرَسُولَهُ كُبِتُوا كَمَا كُبِتَ الَّذِينَ مِن قَبْلِهِمْ وَقَدْ أَنزَلْنَا آيَاتٍ بَيِّنَاتٍ وَلِلْكَافِرِينَ عَذَابٌ مُّهِينٌ',
                'name' => 'سورة المجادلة',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            50 => 
            array (
                'id' => 51,
                'question' => 'أَلَمْ تَرَ إِلَى الَّذِينَ تَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِمْ مَا هُمْ مِنْكُمْ وَلَا مِنْهُمْ 
وَيَحْلِفُونَ عَلَى الْكَذِبِ وَهُمْ يَعْلَمُونَ
',
                'name' => 'سورة المجادلة',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            51 => 
            array (
                'id' => 52,
                'question' => 'إن الذين يحادون الله ورسوله أولئك في الأذلين',
                'name' => 'سورة المجادلة',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            52 => 
            array (
                'id' => 53,
                'question' => 'وَلَوْلا أَن كَتَبَ اللَّهُ عَلَيْهِمُ الْجَلاء لَعَذَّبَهُمْ فِي الدُّنْيَا وَلَهُمْ فِي الآخِرَةِ عَذَابُ النَّارِ',
                'name' => 'سورة الحشر',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            53 => 
            array (
                'id' => 54,
                'question' => 'لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِنْ دِيارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلًا مِنَ اللَّهِ وَرِضْوَانًا وَيَنْصُرُونَ اللَّهَ وَرَسُولَهُ أُولَئِكَ هُمُ الصَّادِقُونَ',
                'name' => 'سورة الحشر',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            54 => 
            array (
                'id' => 55,
                'question' => 'يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ',
                'name' => 'سورة الحشر',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            55 => 
            array (
                'id' => 56,
                'question' => 'لَقَدْ كَانَ لَكُمْ فِيهِمْ أُسْوَةٌ حَسَنَةٌ لِمَن كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الآخِرَ وَمَن يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ',
                'name' => 'سورة الممتحنه',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            56 => 
            array (
                'id' => 57,
                'question' => 'قال تعالي:يَا أَيُّهَا الَّذِينَ آمَنُوا لا تَتَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِمْ قَدْ يَئِسُوا مِنَ الآخِرَةِ كَمَا يَئِسَ الْكُفَّارُ مِنْ أَصْحَابِ الْقُبُورِ. ما هي اسم الصوره التي ذكرت بها هذه الايه؟',
                'name' => 'سورة الممتحنه',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            57 => 
            array (
                'id' => 58,
                'question' => 'إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُم بُنْيَانٌ مَّرْصُوصٌ',
                'name' => 'سورة الصف',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            58 => 
            array (
                'id' => 59,
                'question' => 'يا ايها الذين امنوا هل ادلكم على تجارة تنجيكم من عذاب أليم',
                'name' => 'سورة الصف',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            59 => 
            array (
                'id' => 60,
                'question' => 'قال تعالي: وَأُخْرَى تُحِبُّونَهَا نَصْرٌ مِنَ اللَّهِ وَفَتْحٌ قَرِيبٌ وَبَشِّرِ الْمُؤْمِنِينَ. ماهي اسم السوره التي ذكرت بها الايه؟',
                'name' => 'سورة الصف',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            60 => 
            array (
                'id' => 61,
                'question' => 'قُلْ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلَاقِيكُمْ ثُمَّ تُرَدُّونَ إِلَى عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ',
                'name' => 'سورة الجمعه',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            61 => 
            array (
                'id' => 62,
                'question' => 'يا أيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله',
                'name' => 'سورة المنافقون ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            62 => 
            array (
                'id' => 63,
                'question' => 'قال تعالي: أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ كَفَرُوا مِن قَبْلُ فَذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ. ماهي اسم السوره التي ذكرت بها الايه؟',
                'name' => 'سورة التغابن ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            63 => 
            array (
                'id' => 64,
                'question' => 'يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلادِكُمْ عَدُوًّا لَّكُمْ فَاحْذَرُوهُمْ........اختر تكملة الايه وفي اي سورة وردت هذه الايه؟
',
                'name' => 'سورة التغابن ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            64 => 
            array (
                'id' => 65,
                'question' => 'قال تعالي: ذَٰلِكَ أَمْرُ اللَّهِ أَنزَلَهُ إِلَيْكُمْ ۚ وَمَن يَتَّقِ اللَّهَ يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُعْظِمْ لَهُ أَجْرًا. ماهي اسم السوره التي ذكرت بها الايه؟ ',
                'name' => 'سورة الطلاق ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            65 => 
            array (
                'id' => 66,
                'question' => ':. وَكَأَيِّنْ مِنْ قَرْيَةٍ عَتَتْ عَنْ أَمْرِ رَبِّهَا وَرُسُلِهِ فَحَاسَبْنَاهَا حِسَابًا شَدِيدًا 
وَعَذَّبْنَاهَا عَذَابًا نُكْرًا ',
                'name' => 'سورة الطلاق ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            66 => 
            array (
                'id' => 67,
                'question' => 'يَا أَيُّهَا الَّذِينَ كَفَرُوا لا تَعْتَذِرُوا الْيَوْمَ إِنَّمَا تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ',
                'name' => 'سورة التحريم',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            67 => 
            array (
                'id' => 68,
                'question' => 'ضَرَبَ اللَّهُ مَثَلا لِّلَّذِينَ كَفَرُوا',
                'name' => 'سورة التحريم',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            68 => 
            array (
                'id' => 69,
                'question' => 'قُلْ أَرَأَيْتُمْ إِنْ أَهْلَكَنِيَ اللَّهُ وَمَن مَّعِيَ أَوْ رَحِمَنَا فَمَن يُجِيرُ الْكَافِرِينَ مِنْ عَذَابٍ أَلِيمٍ',
                'name' => 'سورة الملك',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            69 => 
            array (
                'id' => 70,
                'question' => 'وَيَقُولُونَ مَتَى هَذَا الْوَعْدُ إِن كُنتُمْ صَادِقِينَ.قُلْ إِنَّمَا الْعِلْمُ عِندَ اللَّهِ وَإِنَّمَا أَنَا نَذِيرٌ مُّبِينٌ
ماهي اسم السوره التي ذكرت بها الايه؟
',
                'name' => 'سورة الملك',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            70 => 
            array (
                'id' => 71,
                'question' => 'إن للمتقين عند ربهم جنات النعيم',
                'name' => 'سورة القلم ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            71 => 
            array (
                'id' => 72,
                'question' => 'واصبر لحكم ربك ولا تكن كصاحب الحوت إذ نادى وهو مكظوم',
                'name' => 'سورة القلم ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            72 => 
            array (
                'id' => 73,
                'question' => 'فاذا نفخ في الصور نفخة واحدة',
                'name' => 'سورة الحاقة ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            73 => 
            array (
                'id' => 74,
                'question' => ' قال تعالي:فلا أقسم بما تبصرون ومالا تبصرون.وَمَا لا تُبْصِرُونَ. ماهي اسم السوره التي ذكرت بها الايه؟
',
                'name' => 'سورة الحاقة ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            74 => 
            array (
                'id' => 75,
                'question' => 'فَذَرْهُمْ يَخُوضُوا وَيَلْعَبُوا حَتَّى يُلاقُوا يَوْمَهُمُ الَّذِي يُوعَدُونَ',
                'name' => 'سورة المعارج',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            75 => 
            array (
                'id' => 76,
                'question' => 'فلا أقسم برب المشارق والمغارب إنا لقادرون',
                'name' => 'سورة المعارج',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            76 => 
            array (
                'id' => 77,
                'question' => 'أَلَمْ تَرَوْا كَيْفَ خَلَقَ اللَّهُ سَبْعَ سَمَاوَاتٍ طِبَاقًا',
                'name' => 'سورة نوح ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            77 => 
            array (
                'id' => 78,
                'question' => 'وقال نوح ربي لا تذر على الارض من الكافرين ديارا',
                'name' => 'سورة نوح ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            78 => 
            array (
                'id' => 79,
                'question' => 'وَأَنَّا ظَنَنَّا أَن لَّن تَقُولَ الإِنسُ وَالْجِنُّ عَلَى اللَّهِ كَذِبًا',
                'name' => 'سورة الجن',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            79 => 
            array (
                'id' => 80,
                'question' => 'وأن المساجد لله فلا تدعوا مع الله أحدا',
                'name' => 'سورة الجن',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            80 => 
            array (
                'id' => 81,
                'question' => 'واذكر اسم ربك وتبتل إليه تبتيلا',
                'name' => 'سورة المزمل',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            81 => 
            array (
                'id' => 82,
                'question' => 'ان هذه تذكره فمن شاء اتخذ الى ربه سبيلا',
                'name' => 'سورة المزمل',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            82 => 
            array (
                'id' => 83,
                'question' => 'كَلاَّ إِنَّهُ كَانَ لِآيَاتِنَا عَنِيدًا',
                'name' => 'سورة المدثر ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            83 => 
            array (
                'id' => 84,
                'question' => 'كل نفس بما كسبت رهينة',
                'name' => 'سورة المدثر ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            84 => 
            array (
                'id' => 85,
                'question' => 'يسئل أيان يوم القيامه',
                'name' => 'سورة القيامة',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            85 => 
            array (
                'id' => 86,
                'question' => 'كلا إذا بلغت التراقي',
                'name' => 'سورة القيامة',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            86 => 
            array (
                'id' => 87,
                'question' => 'إن الأبرار يشربون من كأس كان مزاجها كافورا',
                'name' => 'سورة الانسان ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            87 => 
            array (
                'id' => 88,
                'question' => 'واذكر اسم ربك بكرة وأصيلا',
                'name' => 'سورة الانسان ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            88 => 
            array (
                'id' => 89,
                'question' => 'هَذَا يَوْمُ الْفَصْلِ جَمَعْنَاكُمْ وَالأَوَّلِينَ',
                'name' => 'سورة المرسلات ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            89 => 
            array (
                'id' => 90,
                'question' => 'ألم نجعل الارض كفاتا',
                'name' => 'سورة المرسلات ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            90 => 
            array (
                'id' => 91,
                'question' => 'ان المتقين في ظلال وعيون',
                'name' => 'سورة المرسلات ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            91 => 
            array (
                'id' => 92,
                'question' => 'إن يوم الفصل كان ميقاتا',
                'name' => 'سورة ألنبأ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            92 => 
            array (
                'id' => 93,
                'question' => 'إن للمتقين مفازا',
                'name' => 'سورة ألنبأ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            93 => 
            array (
                'id' => 94,
                'question' => 'إِذْ نَادَاهُ رَبُّهُ بِالْوَادِ الْمُقَدَّسِ طُوًى',
                'name' => 'سورة النازعات ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            94 => 
            array (
                'id' => 95,
                'question' => 'إن في ذلك لعبرة لمن يخشي',
                'name' => 'سورة النازعات ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            95 => 
            array (
                'id' => 96,
                'question' => 'كلا انها تذكرة.فمن شاء ذكره',
                'name' => 'سورة عبس',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            96 => 
            array (
                'id' => 97,
                'question' => 'فَإِذَا جَاءَتِ الصَّاخَّةُ',
                'name' => 'سورة عبس',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            97 => 
            array (
                'id' => 98,
                'question' => 'وَإِذَا النُّجُومُ انكَدَرَتْ',
                'name' => 'سورة التكوير',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            98 => 
            array (
                'id' => 99,
                'question' => 'فلا أقسم بالخنس',
                'name' => 'سورة التكوير',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            99 => 
            array (
                'id' => 100,
                'question' => 'إِنَّ الأَبْرَارَ لَفِي نَعِيمٍ',
                'name' => 'سورة الانفطار ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            100 => 
            array (
                'id' => 101,
                'question' => 'قال تعالي:يَوْمَ لا تَمْلِكُ نَفْسٌ لِّنَفْسٍ شَيْئًا وَالأَمْرُ يَوْمَئِذٍ لِلَّهِ.اذكر السوره التي ذكرت بها الايه؟',
                'name' => 'سورة الانفطار ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            101 => 
            array (
                'id' => 102,
                'question' => 'كلا ان كتاب الفجار لفي سجين',
                'name' => 'سورة المطففين',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            102 => 
            array (
                'id' => 103,
                'question' => 'ثُمَّ يُقَالُ هَذَا الَّذِي كُنتُم بِهِ تُكَذِّبُونَ',
                'name' => 'سورة المطففين',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            103 => 
            array (
                'id' => 104,
                'question' => 'يَا أَيُّهَا الإِنسَانُ إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحًا فَمُلاقِيهِ',
                'name' => 'سورة الانشقاق ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            104 => 
            array (
                'id' => 105,
                'question' => 'فلا أقسم بالشفق',
                'name' => 'سورة الانشقاق ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            105 => 
            array (
                'id' => 106,
                'question' => 'إِنَّ الَّذِينَ فَتَنُوا الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ثُمَّ لَمْ يَتُوبُوا فَلَهُمْ عَذَابُ جَهَنَّمَ وَلَهُمْ عَذَابُ الْحَرِيقِ',
                'name' => 'سورة البروج ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            106 => 
            array (
                'id' => 107,
                'question' => 'إن بطش ربك لشديد',
                'name' => 'سورة البروج ',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            107 => 
            array (
                'id' => 108,
                'question' => 'وَاتْلُ مَا أُوحِيَ إِلَيْكَ مِن كِتَابِ رَبِّكَ لَا مُبَدِّلَ لِكَلِمَاتِهِ',
                'name' => 'سورة الكهف ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            108 => 
            array (
                'id' => 109,
                'question' => 'وَاضْرِبْ لَهُم مَّثَلَ الْحَيَاةِ الدُّنْيَا كَمَاء أَنزَلْنَاهُ مِنَ السَّمَاء فَاخْتَلَطَ بِهِ نَبَاتُ الأَرْضِ فَأَصْبَحَ هَشِيمًا تَذْرُوهُ الرِّيَاحُ وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ مُّقْتَدِرًا',
                'name' => 'سورة الكهف ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            109 => 
            array (
                'id' => 110,
                'question' => 'قَالَ إِنَّكَ لَن تَسْتَطِيعَ مَعِيَ صَبْرًا.وَكَيْفَ تَصْبِرُ عَلَى مَا لَمْ تُحِطْ بِهِ خُبْرًا

',
                'name' => 'سورة الكهف ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            110 => 
            array (
                'id' => 111,
                'question' => 'قل هل ننبئكم بالأخسرين أعمالا',
                'name' => 'سورة الكهف ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            111 => 
            array (
                'id' => 112,
                'question' => 'وإن الله ربي وربكم فاعبدوه هذا صراط مستقيم',
                'name' => 'سورة مريم ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            112 => 
            array (
                'id' => 113,
                'question' => 'واذكر في الكتاب مريم إذ انتبذت من أهلها مكانا شرقيا',
                'name' => 'سورة مريم ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            113 => 
            array (
                'id' => 114,
                'question' => ' تلك الجنة التي نورث من عبادنا من كان تقيا',
                'name' => 'سورة مريم ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            114 => 
            array (
                'id' => 115,
                'question' => 'انا قد أوحي إلينا أن العذاب على من كذب وتولى',
                'name' => 'سورة طه',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            115 => 
            array (
                'id' => 116,
                'question' => 'أَفَلَمْ يَهْدِ لَهُمْ كَمْ أَهْلَكْنَا قَبْلَهُم مِّنَ ٱلْقُرُونِ يَمْشُونَ فِى مَسَٰكِنِهِمْ ۗ إِنَّ فِى ذَٰلِكَ لَءَايَٰتٍۢ لِّأُوْلِى ٱلنُّهَىٰ',
                'name' => 'سورة طه',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            116 => 
            array (
                'id' => 117,
                'question' => 'وما خلقنا السماء والارض وما بينهما لاعبين',
                'name' => 'سورة الأنبياء',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            117 => 
            array (
                'id' => 118,
                'question' => 'وَنَضَعُ الْمَوَازِينَ الْقِسْطَ لِيَوْمِ الْقِيَامَةِ فَلا تُظْلَمُ نَفْسٌ شَيْئًا وَإِن كَانَ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ أَتَيْنَا بِهَا وَكَفَى بِنَا حَاسِبِينَ',
                'name' => 'سورة الأنبياء',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            118 => 
            array (
                'id' => 119,
                'question' => 'فَمَن يَعْمَلْ مِنَ الصَّالِحَاتِ وَهُوَ مُؤْمِنٌ فَلا كُفْرَانَ لِسَعْيِهِ وَإِنَّا لَهُ كَاتِبُونَ',
                'name' => 'سورة الأنبياء',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            119 => 
            array (
                'id' => 120,
                'question' => 'ذلك بأن الله هو الحق وانه يحيي الموتى وانه علي كل شئ قدير',
                'name' => 'سورة الحج',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            120 => 
            array (
                'id' => 121,
                'question' => 'إِنَّ اللَّهَ يُدَافِعُ عَنِ الَّذِينَ آمَنُوا إِنَّ اللَّهَ لا يُحِبُّ كُلَّ خَوَّانٍ كَفُورٍ
',
                'name' => 'سورة الحج',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            121 => 
            array (
                'id' => 122,
                'question' => 'أَلَمْ تَرَ أَنَّ اللَّهَ أَنزَلَ مِنَ السَّمَاء مَاء فَتُصْبِحُ الأَرْضُ مُخْضَرَّةً إِنَّ اللَّهَ لَطِيفٌ خَبِيرٌ',
                'name' => 'سورة الحج',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            122 => 
            array (
                'id' => 123,
                'question' => 'وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَى قَوْمِهِ فَقَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَهٍ غَيْرُهُ أَفَلا تَتَّقُونَ',
                'name' => 'سورة المؤمنون ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            123 => 
            array (
                'id' => 124,
                'question' => 'يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا إِنِّي بِمَا تَعْمَلُونَ عَلِيمٌ	',
                'name' => 'سورة المؤمنون ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            124 => 
            array (
                'id' => 125,
                'question' => 'وَلَوْ رَحِمْنَاهُمْ وَكَشَفْنَا مَا بِهِم مِّن ضُرٍّ لَّلَجُّوا فِي طُغْيَانِهِمْ يَعْمَهُونَ
',
                'name' => 'سورة المؤمنون ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            125 => 
            array (
                'id' => 126,
                'question' => 'إِنَّ الَّذِينَ جَاؤُوا بِالإِفْكِ عُصْبَةٌ مِّنكُمْ لا تَحْسَبُوهُ شَرًّا لَّكُم بَلْ هُوَ خَيْرٌ لَّكُمْ لِكُلِّ امْرِئٍ مِّنْهُم مَّا اكْتَسَبَ مِنَ الإِثْمِ وَالَّذِي تَوَلَّى كِبْرَهُ مِنْهُمْ لَهُ عَذَابٌ عَظِيمٌ',
                'name' => 'سورة النور ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            126 => 
            array (
                'id' => 127,
                'question' => 'وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَإِلَى اللَّهِ الْمَصِيرُ',
                'name' => 'سورة النور ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            127 => 
            array (
                'id' => 128,
                'question' => 'وَمَن يُطِعِ اللَّهَ وَرَسُولَهُ وَيَخْشَ اللَّهَ وَيَتَّقْهِ فَأُولَئِكَ هُمُ الْفَائِزُونَ',
                'name' => 'سورة النور ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            128 => 
            array (
                'id' => 129,
                'question' => 'الْمُلْكُ يَوْمَئِذٍ الْحَقُّ لِلرَّحْمَنِ وَكَانَ يَوْمًا عَلَى الْكَافِرِينَ عَسِيرًا',
                'name' => 'سورة الفرقان',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            129 => 
            array (
                'id' => 130,
                'question' => 'أَلَمْ تَرَ إِلَى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ وَلَوْ شَاء لَجَعَلَهُ سَاكِنًا ثُمَّ جَعَلْنَا الشَّمْسَ عَلَيْهِ دَلِيلا
',
                'name' => 'سورة الفرقان',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            130 => 
            array (
                'id' => 131,
                'question' => 'إِنَّا نَطْمَعُ أَن يَغْفِرَ لَنَا رَبُّنَا خَطَايَانَا أَن كُنَّا أَوَّلَ الْمُؤْمِنِينَ',
                'name' => 'سورة الشعراء',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            131 => 
            array (
                'id' => 132,
                'question' => 'إِنْ أَنَا إِلَّا نَذِيرٌ مُبِينٌ ',
                'name' => 'سورة الشعراء',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            132 => 
            array (
                'id' => 133,
                'question' => 'فَإِنْ عَصَوْكَ فَقُلْ إِنِّي بَرِيءٌ مِّمَّا تَعْمَلُونَ',
                'name' => 'سورة الشعراء',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            133 => 
            array (
                'id' => 134,
                'question' => 'قَالُوا أَنُؤْمِنُ لَكَ وَاتَّبَعَكَ الأَرْذَلُونَ',
                'name' => 'سورة الشعراء',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            134 => 
            array (
                'id' => 135,
                'question' => 'قَالَ سَنَنظُرُ أَصَدَقْتَ أَمْ كُنتَ مِنَ الْكَاذِبِينَ',
                'name' => 'سورة النمل ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            135 => 
            array (
                'id' => 136,
                'question' => 'وأنجينا الذين آمنوا وكانوا يتقون',
                'name' => 'سورة النمل ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            136 => 
            array (
                'id' => 137,
                'question' => 'وربك يخلق ما يشاء ويختار ماكان لهم الخيرة',
                'name' => 'سورة القصص',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            137 => 
            array (
                'id' => 138,
                'question' => 'فَلَمَّا قَضَى مُوسَى الأَجَلَ وَسَارَ بِأَهْلِهِ آنَسَ مِن جَانِبِ الطُّورِ نَارًا قَالَ لِأَهْلِهِ امْكُثُوا إِنِّي آنَسْتُ نَارًا لَّعَلِّي آتِيكُم مِّنْهَا بِخَبَرٍ أَوْ جَذْوَةٍ مِنَ النَّارِ لَعَلَّكُمْ تَصْطَلُونَ
',
                'name' => 'سورة القصص',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            138 => 
            array (
                'id' => 139,
                'question' => 'قَالَ هَذَا مِنْ عَمَلِ الشَّيْطَانِ إِنَّهُ عَدُوٌّ مُّضِلٌّ مُّبِينٌ',
                'name' => 'سورة القصص',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            139 => 
            array (
                'id' => 140,
                'question' => 'وَوَصَّيْنَا الإِنسَانَ بِوَالِدَيْهِ حُسْنًا وَإِن جَاهَدَاكَ لِتُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلا تُطِعْهُمَا إِلَيَّ مَرْجِعُكُمْ فَأُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ
',
                'name' => 'سورة العنكبوت ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            140 => 
            array (
                'id' => 141,
                'question' => 'وإلى مدين أخاهم شعيبا فقال ياقوم اعبدوا الله وارجوا اليوم الآخر ولا تعثوا في الأرض مفسدين',
                'name' => 'سورة العنكبوت ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            141 => 
            array (
                'id' => 142,
                'question' => 'وَمَا هَذِهِ الْحَيَاةُ الدُّنْيَا إِلاَّ لَهْوٌ وَلَعِبٌ وَإِنَّ الدَّارَ الآخِرَةَ لَهِيَ الْحَيَوَانُ لَوْ كَانُوا يَعْلَمُونَ
',
                'name' => 'سورة العنكبوت ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            142 => 
            array (
                'id' => 143,
                'question' => 'فَسُبْحَانَ اللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ

',
                'name' => 'سورة الروم',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            143 => 
            array (
                'id' => 144,
                'question' => 'ظَهَرَ الْفَسَادُ فِي الْبَرِّ وَالْبَحْرِ بِمَا كَسَبَتْ أَيْدِي النَّاسِ لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا لَعَلَّهُمْ يَرْجِعُونَ ',
                'name' => 'سورة الروم',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            144 => 
            array (
                'id' => 145,
                'question' => 'إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ جَنَّاتُ النَّعِيمِ

',
                'name' => 'سورة لقمان',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            145 => 
            array (
                'id' => 146,
                'question' => 'قل يتوفاكم ملك الموت الذي وكل بكم ثم الى ربكم ترجعون',
                'name' => 'سورة لقمان',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            146 => 
            array (
                'id' => 147,
                'question' => 'لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ لِّمَن كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الآخِرَ وَذَكَرَ اللَّهَ كَثِيرًا

',
                'name' => 'سورة الأحزاب',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            147 => 
            array (
                'id' => 148,
                'question' => 'إِنَّ اللَّهَ وَمَلائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا
',
                'name' => 'سورة الأحزاب',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            148 => 
            array (
                'id' => 149,
                'question' => 'يَسْأَلُكَ النَّاسُ عَنِ السَّاعَةِ قُلْ إِنَّمَا عِلْمُهَا عِندَ اللَّهِ وَمَا يُدْرِيكَ لَعَلَّ السَّاعَةَ تَكُونُ قَرِيبًا

',
                'name' => 'سورة الأحزاب',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            149 => 
            array (
                'id' => 150,
                'question' => 'الْحَمْدُ لِلَّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ وَلَهُ الْحَمْدُ فِي الآخِرَةِ وَهُوَ الْحَكِيمُ الْخَبِيرُ

',
                'name' => 'سورة سبأ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            150 => 
            array (
                'id' => 151,
                'question' => 'قُلْ مَن يَرْزُقُكُم مِّنَ السَّمَاوَاتِ وَالأَرْضِ قُلِ اللَّهُ وَإِنَّا أَوْ إِيَّاكُمْ لَعَلَى هُدًى أَوْ فِي ضَلالٍ مُّبِينٍ

',
                'name' => 'سورة سبأ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            151 => 
            array (
                'id' => 152,
                'question' => 'قُلْ إِنَّمَا أَعِظُكُم بِوَاحِدَةٍ أَن تَقُومُوا لِلَّهِ مَثْنَى وَفُرَادَى ثُمَّ تَتَفَكَّرُوا مَا بِصَاحِبِكُم مِّن جِنَّةٍ إِنْ هُوَ إِلاَّ نَذِيرٌ لَّكُم بَيْنَ يَدَيْ عَذَابٍ شَدِيدٍ

',
                'name' => 'سورة سبأ',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            152 => 
            array (
                'id' => 153,
                'question' => 'يَا أَيُّهَا النَّاسُ إِنَّ وَعْدَ اللَّهِ حَقٌّ فَلا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا وَلا يَغُرَّنَّكُم بِاللَّهِ الْغَرُورُ
',
                'name' => 'سورة فاطر',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            153 => 
            array (
                'id' => 154,
                'question' => 'إِنَّ الَّذِينَ يَتْلُونَ كِتَابَ اللَّهِ وَأَقَامُوا الصَّلاةَ وَأَنفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلانِيَةً يَرْجُونَ تِجَارَةً لَّن تَبُورَ

',
                'name' => 'سورة فاطر',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            154 => 
            array (
                'id' => 155,
                'question' => 'إِنَّ اللَّهَ يُمْسِكُ السَّمَاوَاتِ وَالأَرْضَ أَن تَزُولا وَلَئِن زَالَتَا إِنْ أَمْسَكَهُمَا مِنْ أَحَدٍ مِّن بَعْدِهِ إِنَّهُ كَانَ حَلِيمًا غَفُورًا

',
                'name' => 'سورة فاطر',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            155 => 
            array (
                'id' => 156,
                'question' => 'يَا أَيُّهَا النَّاسُ اعْبُدُواْ رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ

',
                'name' => 'سورة البقرة ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            156 => 
            array (
                'id' => 157,
                'question' => 'واذ اتينا موسى الكتاب والفرقان لعلكم تهتدون',
                'name' => 'سورة البقرة ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            157 => 
            array (
                'id' => 158,
                'question' => 'وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ وَقَفَّيْنَا مِن بَعْدِهِ بِالرُّسُلِ وَآتَيْنَا عِيسَى ابْنَ مَرْيَمَ الْبَيِّنَاتِ وَأَيَّدْنَاهُ بِرُوحِ الْقُدُسِ أَفَكُلَّمَا جَاءَكُمْ رَسُولٌ بِمَا لاَ تَهْوَى أَنفُسُكُمُ اسْتَكْبَرْتُمْ فَفَرِيقاً كَذَّبْتُمْ وَفَرِيقًا تَقْتُلُونَ

',
                'name' => 'سورة البقرة ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            158 => 
            array (
                'id' => 159,
                'question' => 'إنا أرسلناك بالحق بشيراً ونذيراً ولا تسأل عن أصحاب الجحيم',
                'name' => 'سورة البقرة ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            159 => 
            array (
                'id' => 160,
                'question' => 'يَا أَيُّهَا النَّاسُ كُلُواْ مِمَّا فِي الأَرْضِ حَلالاً طَيِّبًا وَلاَ تَتَّبِعُواْ خُطُوَاتِ الشَّيْطَانِ إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ

',
                'name' => 'سورة البقرة ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            160 => 
            array (
                'id' => 161,
                'question' => 'كَانَ النَّاسُ أُمَّةً وَاحِدَةً فَبَعَثَ اللَّهُ النَّبِيِّينَ مُبَشِّرِينَ وَمُنذِرِينَ',
                'name' => 'سورة البقرة ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            161 => 
            array (
                'id' => 162,
                'question' => 'وقاتلوا في سبيل الله واعلموا ان الله سميع عليم',
                'name' => 'سورة البقرة ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            162 => 
            array (
                'id' => 163,
                'question' => 'ليس عليك هداهم ولكن الله يهدي من يشاء',
                'name' => 'سورة البقرة ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            163 => 
            array (
                'id' => 164,
                'question' => 'وَاتَّقُواْ يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللَّهِ ثُمَّ تُوَفَّى كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لاَ يُظْلَمُونَ

',
                'name' => 'سورة البقرة ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            164 => 
            array (
                'id' => 165,
                'question' => 'وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ أَرِنِي كَيْفَ تُحْيِي الْمَوْتَى قَالَ أَوَلَمْ تُؤْمِن قَالَ بَلَى وَلَكِن لِّيَطْمَئِنَّ قَلْبِي قَالَ فَخُذْ أَرْبَعَةً مِّنَ الطَّيْرِ فَصُرْهُنَّ إِلَيْكَ ثُمَّ اجْعَلْ عَلَى كُلِّ جَبَلٍ مِّنْهُنَّ جُزْءًا ثُمَّ ادْعُهُنَّ يَأْتِينَكَ سَعْيًا وَاعْلَمْ أَنَّ اللَّهَ عَزِيزٌ حَكِيمٌ

',
                'name' => 'سورة البقرة ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            165 => 
            array (
                'id' => 166,
                'question' => 'قل للذين كفروا ستغلبون وتحشرون إلى جهنم وبئس المهاد',
                'name' => 'سورة ال عمران',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            166 => 
            array (
                'id' => 167,
                'question' => 'ان الله ربى وربكم فاعبدوه هذا صراط مستقيم',
                'name' => 'سورة ال عمران',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            167 => 
            array (
                'id' => 168,
                'question' => 'وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ النَّبِيِّينَ لَمَا آتَيْتُكُم مِّن كِتَابٍ وَحِكْمَةٍ ثُمَّ جَاءَكُمْ رَسُولٌ مُّصَدِّقٌ لِّمَا مَعَكُمْ لَتُؤْمِنُنَّ بِهِ وَلَتَنصُرُنَّهُ قَالَ أَأَقْرَرْتُمْ وَأَخَذْتُمْ عَلَى ذَلِكُمْ إِصْرِي قَالُواْ أَقْرَرْنَا قَالَ فَاشْهَدُواْ وَأَنَاْ مَعَكُم مِّنَ الشَّاهِدِينَ

',
                'name' => 'سورة ال عمران',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            168 => 
            array (
                'id' => 169,
                'question' => 'إِنَّ الَّذِينَ كَفَرُواْ لَن تُغْنِيَ عَنْهُمْ أَمْوَالُهُمْ وَلاَ أَوْلادُهُم مِّنَ اللَّهِ شَيْئًا وَأُولَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ

',
                'name' => 'سورة ال عمران',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            169 => 
            array (
                'id' => 170,
                'question' => 'قال تعالي:ثُمَّ صَرَفَكُمْ عَنْهُمْ لِيَبْتَلِيَكُمْ وَلَقَدْ عَفَا عَنكُمْ وَاللَّهُ ذُو فَضْلٍ عَلَى الْمُؤْمِنِينَ. ماهي اسم السورة التي ذكرت بها الايه؟',
                'name' => 'سورة ال عمران',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            170 => 
            array (
                'id' => 171,
                'question' => 'لَقَدْ سَمِعَ اللَّهُ قَوْلَ الَّذِينَ قَالُوا إِنَّ اللَّهَ فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ',
                'name' => 'سورة ال عمران',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            171 => 
            array (
                'id' => 172,
                'question' => 'لِّلرِّجَالِ نَصِيبٌ مِّمَّا تَرَكَ الْوَالِدَانِ وَالأَقْرَبُونَ وَلِلنِّسَاء نَصِيبٌ مِّمَّا تَرَكَ الْوَالِدَانِ وَالأَقْرَبُونَ مِمَّا قَلَّ مِنْهُ أَوْ كَثُرَ نَصِيبًا مَّفْرُوضًا

',
                'name' => 'سورة النساء',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            172 => 
            array (
                'id' => 173,
                'question' => 'حُرِّمَتْ عَلَيْكُمْ أُمَّهَاتُكُمْ وَبَنَاتُكُمْ وَأَخَوَاتُكُمْ وَعَمَّاتُكُمْ',
                'name' => 'سورة النساء',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            173 => 
            array (
                'id' => 174,
                'question' => 'ان الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء',
                'name' => 'سورة النساء',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            174 => 
            array (
                'id' => 175,
                'question' => 'مَّنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ وَمَن تَوَلَّى فَمَا أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظًا

',
                'name' => 'سورة النساء',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            175 => 
            array (
                'id' => 176,
                'question' => 'إِنَّا أَنزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ لِتَحْكُمَ بَيْنَ النَّاسِ بِمَا أَرَاكَ اللَّهُ وَلاَ تَكُن لِّلْخَائِنِينَ خَصِيمًا

',
                'name' => 'سورة النساء',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            176 => 
            array (
                'id' => 177,
                'question' => 'بشر المنافقين بأن لهم عذابا أليما',
                'name' => 'سورة النساء',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            177 => 
            array (
                'id' => 178,
                'question' => 'لَنْ يَسْتَنْكِفَ الْمَسِيحُ أَنْ يَكُونَ عَبْدًا لِلَّهِ وَلَا الْمَلَائِكَةُ الْمُقَرَّبُونَ وَمَنْ يَسْتَنْكِفْ عَنْ عِبَادَتِهِ وَيَسْتَكْبِرْ فَسَيَحْشُرُهُمْ إِلَيْهِ جَمِيعًا ',
                'name' => 'سورة النساء',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            178 => 
            array (
                'id' => 179,
                'question' => 'يَا أَيُّهَا الَّذِينَ آمَنُواْ كُونُواْ قَوَّامِينَ لِلَّهِ شُهَدَاء بِالْقِسْطِ
',
                'name' => 'سورة المائده ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            179 => 
            array (
                'id' => 180,
                'question' => 'يَا أَيُّهَا الَّذِينَ آمَنُواْ اتَّقُواْ اللَّهَ وَابْتَغُواْ إِلَيْهِ الْوَسِيلَةَ وَجَاهِدُواْ فِي سَبِيلِهِ لَعَلَّكُمْ تُفْلِحُونَ

',
                'name' => 'سورة المائده ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            180 => 
            array (
                'id' => 181,
                'question' => 'افحكم الجاهلية يبغون ومن احسن من الله حكما لقوم يوقنون',
                'name' => 'سورة المائده ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            181 => 
            array (
                'id' => 182,
                'question' => 'يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنزِلَ إِلَيْكَ مِن رَّبِّكَ وَإِن لَّمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالَتَهُ وَاللَّهُ يَعْصِمُكَ مِنَ النَّاسِ إِنَّ اللَّهَ لاَ يَهْدِي الْقَوْمَ الْكَافِرِينَ

',
                'name' => 'سورة المائده ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            182 => 
            array (
                'id' => 183,
                'question' => 'يَا أَيُّهَا الَّذِينَ آَمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ إِلَى اللَّهِ
مَرْجِعُكُمْ جَمِيعًا فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ 
',
                'name' => 'سورة المائده ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            183 => 
            array (
                'id' => 184,
                'question' => 'يَوْمَ يَجْمَعُ اللَّهُ الرُّسُلَ فَيَقُولُ مَاذَا أُجِبْتُمْ قَالُواْ لاَ عِلْمَ لَنَا إِنَّكَ أَنتَ عَلاَّمُ الْغُيُوبِ

',
                'name' => 'سورة المائده ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            184 => 
            array (
                'id' => 185,
                'question' => 'فَقَدْ كَذَّبُواْ بِالْحَقِّ لَمَّا جَاءَهُمْ فَسَوْفَ يَأْتِيهِمْ أَنبَاء مَا كَانُواْ بِهِ يَسْتَهْزِؤُونَ

',
                'name' => 'سورة الانعام ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            185 => 
            array (
                'id' => 186,
                'question' => 'وقالوا إن هي إلا حياتنا الدنيا وما نحن بمبعوثين',
                'name' => 'سورة الانعام ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            186 => 
            array (
                'id' => 187,
                'question' => 'لكل نبأ مستقر وسوف تعلمون',
                'name' => 'سورة الانعام ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            187 => 
            array (
                'id' => 188,
                'question' => 'إِنَّ اللَّهَ فَالِقُ الْحَبِّ وَالنَّوَى يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَمُخْرِجُ الْمَيِّتِ مِنَ الْحَيِّ ذَلِكُمُ اللَّهُ فَأَنَّى تُؤْفَكُونَ

',
                'name' => 'سورة الانعام ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            188 => 
            array (
                'id' => 189,
                'question' => 'وهذا صراط ربك مستقيما قد فصلنا الآيات لقوم يذكرون',
                'name' => 'سورة الانعام ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            189 => 
            array (
                'id' => 190,
                'question' => 'فَإِنْ كَذَّبُوكَ فَقُلْ رَبُّكُمْ ذُو رَحْمَةٍ وَاسِعَةٍ وَلَا يُرَدُّ بَأْسُهُ عَنِ الْقَوْمِ الْمُجْرِمِينَ',
                'name' => 'سورة الانعام ',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            190 => 
            array (
                'id' => 191,
                'question' => 'وَيَا آدَمُ اسْكُنْ أَنتَ وَزَوْجُكَ الْجَنَّةَ فَكُلاَ مِنْ حَيْثُ شِئْتُمَا وَلاَ تَقْرَبَا هَذِهِ الشَّجَرَةَ فَتَكُونَا مِنَ الظَّالِمِينَ

',
                'name' => 'سورة الاعراف',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            191 => 
            array (
                'id' => 192,
                'question' => 'وَالَّذِينَ آَمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَا نُكَلِّفُ نَفْسًا إِلَّا وُسْعَهَا أُولَئِكَ أَصْحَابُ الْجَنَّةِ
هُمْ فِيهَا خَالِدُونَ 
',
                'name' => 'سورة الاعراف',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            192 => 
            array (
                'id' => 193,
                'question' => 'قُلْ يَا أَيُّهَا النَّاسُ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ جَمِيعًا الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ',
                'name' => 'سورة الاعراف',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            193 => 
            array (
                'id' => 194,
                'question' => 'إِنَّ وَلِيِّيَ اللَّهُ الَّذِي نَزَّلَ الْكِتَابَ وَهُوَ يَتَوَلَّى الصَّالِحِينَ

',
                'name' => 'سورة الاعراف',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            194 => 
            array (
                'id' => 195,
                'question' => 'وَإِلَى مَدْيَنَ أَخَاهُمْ شُعَيْبًا قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَهٍ غَيْرُهُ',
                'name' => 'سورة الاعراف',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            195 => 
            array (
                'id' => 196,
                'question' => 'وَمَا جَعَلَهُ اللَّهُ إِلَّا بُشْرَى وَلِتَطْمَئِنَّ بِهِ قُلُوبُكُمْ وَمَا النَّصْرُ إِلَّا مِنْ عِنْدِ اللَّهِ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ',
                'name' => 'سورة الانفال',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            196 => 
            array (
                'id' => 197,
                'question' => 'يَا أَيُّهَا الَّذِينَ آمَنُواْ إِن تَتَّقُواْ اللَّهَ يَجْعَل لَّكُمْ فُرْقَاناً وَيُكَفِّرْ عَنكُمْ سَيِّئَاتِكُمْ وَيَغْفِرْ لَكُمْ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ

',
                'name' => 'سورة الانفال',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            197 => 
            array (
                'id' => 198,
                'question' => 'قُلْ لِلَّذِينَ كَفَرُوا إِنْ يَنْتَهُوا يُغْفَرْ لَهُمْ مَا قَدْ سَلَفَ وَإِنْ يَعُودُوا فَقَدْ مَضَتْ سُنَّةُ الْأَوَّلِينَ ',
                'name' => 'سورة الانفال',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            198 => 
            array (
                'id' => 199,
                'question' => 'يا ايها النبي حسبك الله ومن اتبعك من المؤمنين',
                'name' => 'سورة الانفال',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            199 => 
            array (
                'id' => 200,
                'question' => 'إِنَّمَا يَعْمُرُ مَسَاجِدَ اللَّهِ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الآخِرِ وَأَقَامَ الصَّلاةَ وَآتَى الزَّكَاةَ وَلَمْ يَخْشَ إِلاَّ اللَّهَ فَعَسَى أُوْلَئِكَ أَن يَكُونُواْ مِنَ الْمُهْتَدِينَ',
                'name' => 'سورة التوبه',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            200 => 
            array (
                'id' => 201,
                'question' => 'يَا أَيُّهَا الَّذِينَ آمَنُواْ مَا لَكُمْ إِذَا قِيلَ لَكُمُ انفِرُواْ فِي سَبِيلِ اللَّهِ اثَّاقَلْتُمْ إِلَى الأَرْضِ أَرَضِيتُم بِالْحَيَاةِ الدُّنْيَا مِنَ الآخِرَةِ فَمَا مَتَاعُ الْحَيَاةِ الدُّنْيَا فِي الآخِرَةِ إِلاَّ قَلِيلٌ

',
                'name' => 'سورة التوبه',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            201 => 
            array (
                'id' => 202,
                'question' => 'وَالْمُؤْمِنُونَ وَالْمُؤْمِنَاتُ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ يَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنْكَرِ',
                'name' => 'سورة التوبه',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            202 => 
            array (
                'id' => 203,
                'question' => 'خُذْ مِنْ أَمْوَالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيْهِمْ إِنَّ صَلاتَكَ سَكَنٌ لَّهُمْ وَاللَّهُ سَمِيعٌ عَلِيمٌ

',
                'name' => 'سورة التوبه',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            203 => 
            array (
                'id' => 204,
                'question' => 'إِنَّ اللَّهَ لَهُ مُلْكُ السَّمَاوَاتِ وَالأَرْضِ يُحْيِي وَيُمِيتُ وَمَا لَكُم مِّن دُونِ اللَّهِ مِن وَلِيٍّ وَلاَ نَصِيرٍ',
                'name' => 'سورة التوبه',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            204 => 
            array (
                'id' => 205,
                'question' => 'إنما مثل الحياة الدنيا كماء أنزلناه من السماء ',
                'name' => 'سورة يونس',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            205 => 
            array (
                'id' => 206,
                'question' => 'إِنَّ اللَّهَ لَا يَظْلِمُ النَّاسَ شَيْئًا وَلَكِنَّ النَّاسَ أَنْفُسَهُمْ يَظْلِمُونَ',
                'name' => 'سورة يونس',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            206 => 
            array (
                'id' => 207,
                'question' => 'مَتَاعٌ فِي الدُّنْيَا ثُمَّ إِلَيْنَا مَرْجِعُهُمْ ثُمَّ نُذِيقُهُمُ الْعَذَابَ الشَّدِيدَ بِمَا كَانُواْ يَكْفُرُونَ

',
                'name' => 'سورة يونس',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            207 => 
            array (
                'id' => 208,
                'question' => 'ان الذين حقت عليهم كلمة ربك لا يؤمنون',
                'name' => 'سورة يونس',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            208 => 
            array (
                'id' => 209,
                'question' => 'أفمن يخلق كمن لا يخلق أفلا تذكرون',
                'name' => 'سورة النحل',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            209 => 
            array (
                'id' => 210,
                'question' => 'وَأَقْسَمُواْ بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لاَ يَبْعَثُ اللَّهُ مَن يَمُوتُ بَلَى وَعْدًا عَلَيْهِ حَقًّا وَلَكِنَّ أَكْثَرَ النَّاسِ لاَ يَعْلَمُونَ

',
                'name' => 'سورة النحل',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            210 => 
            array (
                'id' => 211,
                'question' => 'وَمِن ثَمَرَاتِ النَّخِيلِ وَالأَعْنَابِ تَتَّخِذُونَ مِنْهُ سَكَرًا وَرِزْقًا حَسَنًا إِنَّ فِي ذَلِكَ لآيَةً لِّقَوْمٍ يَعْقِلُونَ

',
                'name' => 'سورة النحل',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            211 => 
            array (
                'id' => 212,
                'question' => 'إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالإِحْسَانِ وَإِيتَاء ذِي الْقُرْبَى وَيَنْهَى عَنِ الْفَحْشَاء وَالْمُنكَرِ وَالْبَغْيِ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ

',
                'name' => 'سورة النحل',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            212 => 
            array (
                'id' => 213,
                'question' => 'إِنَّ إِبْرَاهِيمَ كَانَ أُمَّةً قَانِتًا لِلَّهِ حَنِيفًا وَلَمْ يَكُ مِنَ الْمُشْرِكِينَ

',
                'name' => 'سورة النحل',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            213 => 
            array (
                'id' => 214,
                'question' => 'إِنَّ هَذَا الْقُرْآنَ يَهْدِي لِلَّتِي هِيَ أَقْوَمُ وَيُبَشِّرُ الْمُؤْمِنِينَ الَّذِينَ يَعْمَلُونَ الصَّالِحَاتِ أَنَّ لَهُمْ أَجْرًا كَبِيرًا
',
                'name' => 'سورة الاسراء',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            214 => 
            array (
                'id' => 215,
                'question' => 'وَلاَ تَقْرَبُواْ مَالَ الْيَتِيمِ إِلاَّ بِالَّتِي هِيَ أَحْسَنُ حَتَّى يَبْلُغَ أَشُدَّهُ وَأَوْفُواْ بِالْعَهْدِ إِنَّ الْعَهْدَ كَانَ مَسْؤُولاً

',
                'name' => 'سورة الاسراء',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            215 => 
            array (
                'id' => 216,
                'question' => 'وَلَقَدْ كَرَّمْنَا بَنِي آدَمَ وَحَمَلْنَاهُمْ فِي الْبَرِّ وَالْبَحْرِ وَرَزَقْنَاهُم مِّنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَى كَثِيرٍ مِّمَّنْ خَلَقْنَا تَفْضِيلاً
',
                'name' => 'سورة الاسراء',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            216 => 
            array (
                'id' => 217,
                'question' => 'وَلَقَدْ آتَيْنَا مُوسَى تِسْعَ آيَاتٍ بَيِّنَاتٍ فَاسْأَلْ بَنِي إِسْرَائِيلَ إِذْ جَاءَهُمْ فَقَالَ لَهُ فِرْعَوْنُ إِنِّي لَأَظُنُّكَ يَا مُوسَى مَسْحُورًا

',
                'name' => 'سورة الاسراء',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            217 => 
            array (
                'id' => 218,
                'question' => 'وبالحق أنزلناه وبالحق نزل',
                'name' => 'سورة الاسراء',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            218 => 
            array (
                'id' => 219,
                'question' => 'وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ إِلَّا عَلَى اللَّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا كُلٌّ فِي كِتَابٍ مُبِينٍ',
                'name' => 'سورة هود ',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            219 => 
            array (
                'id' => 220,
                'question' => 'وَأُوحِيَ إِلَى نُوحٍ أَنَّهُ لَن يُؤْمِنَ مِن قَوْمِكَ إِلاَّ مَن قَدْ آمَنَ فَلاَ تَبْتَئِسْ بِمَا كَانُواْ يَفْعَلُونَ
',
                'name' => 'سورة هود ',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            220 => 
            array (
                'id' => 221,
                'question' => 'وَأُتْبِعُواْ فِي هَذِهِ الدُّنْيَا لَعْنَةً وَيَوْمَ الْقِيَامَةِ أَلا إِنَّ عَادًا كَفَرُواْ رَبَّهُمْ أَلاَ بُعْدًا لِّعَادٍ قَوْمِ هُودٍ

',
                'name' => 'سورة هود ',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            221 => 
            array (
                'id' => 222,
                'question' => 'وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَى وَهِيَ ظَالِمَةٌ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ',
                'name' => 'سورة هود ',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            222 => 
            array (
                'id' => 223,
                'question' => 'وَجَاؤُواْ أَبَاهُمْ عِشَاء يَبْكُونَ

',
                'name' => 'سورة يوسف',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            223 => 
            array (
                'id' => 224,
                'question' => 'وَدَخَلَ مَعَهُ السِّجْنَ فَتَيَانِ قَالَ أَحَدُهُمَا إِنِّي أَرَانِي أَعْصِرُ خَمْرًا',
                'name' => 'سورة يوسف',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            224 => 
            array (
                'id' => 225,
                'question' => 'وَمَا أُبَرِّئُ نَفْسِي إِنَّ النَّفْسَ لأَمَّارَةٌ بِالسُّوءِ إِلاَّ مَا رَحِمَ رَبِّيَ إِنَّ رَبِّي غَفُورٌ رَّحِيمٌ

',
                'name' => 'سورة يوسف',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            225 => 
            array (
                'id' => 226,
                'question' => 'قَالُواْ إِن يَسْرِقْ فَقَدْ سَرَقَ أَخٌ لَّهُ مِن قَبْلُ فَأَسَرَّهَا يُوسُفُ فِي نَفْسِهِ وَلَمْ يُبْدِهَا لَهُمْ قَالَ أَنتُمْ شَرٌّ مَّكَانًا وَاللَّهُ أَعْلَمْ بِمَا تَصِفُونَ',
                'name' => 'سورة يوسف',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            226 => 
            array (
                'id' => 227,
                'question' => 'قَالَ سَوْفَ أَسْتَغْفِرُ لَكُمْ رَبِّيَ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ

',
                'name' => 'سورة يوسف',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            227 => 
            array (
                'id' => 228,
                'question' => 'وَيَسْتَعْجِلُونَكَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ وَقَدْ خَلَتْ مِن قَبْلِهِمُ الْمَثُلاتُ وَإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِّلنَّاسِ عَلَى ظُلْمِهِمْ وَإِنَّ رَبَّكَ لَشَدِيدُ الْعِقَابِ
',
                'name' => 'سورة الرعد ',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            228 => 
            array (
                'id' => 229,
                'question' => 'وَالَّذِينَ يَصِلُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُونَ سُوءَ الْحِسَابِ',
                'name' => 'سورة الرعد',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            229 => 
            array (
                'id' => 230,
                'question' => 'مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ أُكُلُهَا دَائِمٌ وَظِلُّهَا',
                'name' => 'سورة الرعد',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            230 => 
            array (
                'id' => 231,
                'question' => 'وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِن شَكَرْتُمْ لأَزِيدَنَّكُمْ وَلَئِن كَفَرْتُمْ إِنَّ عَذَابِي لَشَدِيدٌ

',
                'name' => 'سورة ابراهيم',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            231 => 
            array (
                'id' => 232,
                'question' => 'وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لَا يَبْعَثُ اللَّهُ مَنْ يَمُوتُ بَلَى وَعْدًا عَلَيْهِ حَقًّا 
وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ',
                'name' => 'سورة النحل',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            232 => 
            array (
                'id' => 233,
                'question' => 'فَلَا تَحْسَبَنَّ اللَّهَ مُخْلِفَ وَعْدِهِ رُسُلَهُ إِنَّ اللَّهَ عَزِيزٌ ذُو انْتِقَامٍ',
                'name' => 'سورة ابراهيم',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            233 => 
            array (
                'id' => 234,
                'question' => ' وَإِنْ تَعُدُّوا نِعْمَةَ اللَّهِ لَا تُحْصُوهَا إِنَّ اللَّهَ لَغَفُورٌ رَحِيمٌ',
                'name' => 'سورة النحل',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            234 => 
            array (
                'id' => 235,
                'question' => 'ان المتقين فى جنات وعيون',
                'name' => 'سورة الحجر',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            235 => 
            array (
                'id' => 236,
                'question' => 'وَلَقَدْ آتَيْنَاكَ سَبْعًا مِّنَ الْمَثَانِي وَالْقُرْآنَ الْعَظِيمَ
',
                'name' => 'سورة الحجر',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            236 => 
            array (
                'id' => 237,
                'question' => 'وَإِلَى ثَمُودَ أَخَاهُمْ صَالِحًا قَالَ يَا قَوْمِ اعْبُدُواْ اللَّهَ مَا لَكُم مِّنْ إِلَهٍ غَيْرُهُ هُوَ أَنشَأَكُم مِّنَ الأَرْضِ وَاسْتَعْمَرَكُمْ فِيهَا فَاسْتَغْفِرُوهُ ثُمَّ تُوبُواْ إِلَيْهِ إِنَّ رَبِّي قَرِيبٌ مُّجِيبٌ',
                'name' => 'سورة هود',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            237 => 
            array (
                'id' => 238,
                'question' => 'وَإِذَا أَنْعَمْنَا عَلَى الإِنسَانِ أَعْرَضَ وَنَأَى بِجَانِبِهِ وَإِذَا مَسَّهُ الشَّرُّ كَانَ يَؤُوسًا

',
                'name' => 'سورة الاسراء',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            238 => 
            array (
                'id' => 239,
                'question' => 'أَفَأَصْفَاكُمْ رَبُّكُم بِالْبَنِينَ وَاتَّخَذَ مِنَ الْمَلائِكَةِ إِنَاثًا إِنَّكُمْ لَتَقُولُونَ قَوْلاً عَظِيمًا

',
                'name' => 'سورة الاسراء',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            239 => 
            array (
                'id' => 240,
                'question' => 'إِنَّ الَّذِينَ يُحَادُّونَ اللَّهَ وَرَسُولَهُ كُبِتُوا كَمَا كُبِتَ الَّذِينَ مِن قَبْلِهِمْ وَقَدْ أَنزَلْنَا آيَاتٍ بَيِّنَاتٍ وَلِلْكَافِرِينَ عَذَابٌ مُّهِينٌ',
                'name' => 'سورة المجادلة',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            240 => 
            array (
                'id' => 241,
                'question' => 'أَلَمْ تَرَ إِلَى الَّذِينَ تَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِمْ مَا هُمْ مِنْكُمْ وَلَا مِنْهُمْ 
وَيَحْلِفُونَ عَلَى الْكَذِبِ وَهُمْ يَعْلَمُونَ
',
                'name' => 'سورة المجادلة',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            241 => 
            array (
                'id' => 242,
                'question' => 'إن الذين يحادون الله ورسوله أولئك في الأذلين',
                'name' => 'سورة المجادلة',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            242 => 
            array (
                'id' => 243,
                'question' => 'وَلَوْلا أَن كَتَبَ اللَّهُ عَلَيْهِمُ الْجَلاء لَعَذَّبَهُمْ فِي الدُّنْيَا وَلَهُمْ فِي الآخِرَةِ عَذَابُ النَّارِ',
                'name' => 'سورة الحشر',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            243 => 
            array (
                'id' => 244,
                'question' => 'لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِنْ دِيارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلًا مِنَ اللَّهِ وَرِضْوَانًا وَيَنْصُرُونَ اللَّهَ وَرَسُولَهُ أُولَئِكَ هُمُ الصَّادِقُونَ',
                'name' => 'سورة الحشر',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            244 => 
            array (
                'id' => 245,
                'question' => 'يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ',
                'name' => 'سورة الحشر',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            245 => 
            array (
                'id' => 246,
                'question' => 'لَقَدْ كَانَ لَكُمْ فِيهِمْ أُسْوَةٌ حَسَنَةٌ لِمَن كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الآخِرَ وَمَن يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ',
                'name' => 'سورة الممتحنه',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            246 => 
            array (
                'id' => 247,
                'question' => 'قال تعالي:يَا أَيُّهَا الَّذِينَ آمَنُوا لا تَتَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِمْ قَدْ يَئِسُوا مِنَ الآخِرَةِ كَمَا يَئِسَ الْكُفَّارُ مِنْ أَصْحَابِ الْقُبُورِ. ما هي اسم الصوره التي ذكرت بها هذه الايه؟',
                'name' => 'سورة الممتحنه',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            247 => 
            array (
                'id' => 248,
                'question' => 'إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُم بُنْيَانٌ مَّرْصُوصٌ',
                'name' => 'سورة الصف',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            248 => 
            array (
                'id' => 249,
                'question' => 'يا ايها الذين امنوا هل ادلكم على تجارة تنجيكم من عذاب أليم',
                'name' => 'سورة الصف',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            249 => 
            array (
                'id' => 250,
                'question' => 'قال تعالي: وَأُخْرَى تُحِبُّونَهَا نَصْرٌ مِنَ اللَّهِ وَفَتْحٌ قَرِيبٌ وَبَشِّرِ الْمُؤْمِنِينَ. ماهي اسم السوره التي ذكرت بها الايه؟',
                'name' => 'سورة الصف',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            250 => 
            array (
                'id' => 251,
                'question' => 'قُلْ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلَاقِيكُمْ ثُمَّ تُرَدُّونَ إِلَى عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ',
                'name' => 'سورة الجمعه',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            251 => 
            array (
                'id' => 252,
                'question' => 'يا أيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله',
                'name' => 'سورة المنافقون ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            252 => 
            array (
                'id' => 253,
                'question' => 'قال تعالي: أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ كَفَرُوا مِن قَبْلُ فَذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ. ماهي اسم السوره التي ذكرت بها الايه؟',
                'name' => 'سورة التغابن ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            253 => 
            array (
                'id' => 254,
                'question' => 'يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلادِكُمْ عَدُوًّا لَّكُمْ فَاحْذَرُوهُمْ........اختر تكملة الايه وفي اي سورة وردت هذه الايه؟
',
                'name' => 'سورة التغابن ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            254 => 
            array (
                'id' => 255,
                'question' => 'قال تعالي: ذَٰلِكَ أَمْرُ اللَّهِ أَنزَلَهُ إِلَيْكُمْ ۚ وَمَن يَتَّقِ اللَّهَ يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُعْظِمْ لَهُ أَجْرًا. ماهي اسم السوره التي ذكرت بها الايه؟ ',
                'name' => 'سورة الطلاق ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            255 => 
            array (
                'id' => 256,
                'question' => ':. وَكَأَيِّنْ مِنْ قَرْيَةٍ عَتَتْ عَنْ أَمْرِ رَبِّهَا وَرُسُلِهِ فَحَاسَبْنَاهَا حِسَابًا شَدِيدًا 
وَعَذَّبْنَاهَا عَذَابًا نُكْرًا ',
                'name' => 'سورة الطلاق ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            256 => 
            array (
                'id' => 257,
                'question' => 'يَا أَيُّهَا الَّذِينَ كَفَرُوا لا تَعْتَذِرُوا الْيَوْمَ إِنَّمَا تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ',
                'name' => 'سورة التحريم',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            257 => 
            array (
                'id' => 258,
                'question' => 'ضَرَبَ اللَّهُ مَثَلا لِّلَّذِينَ كَفَرُوا',
                'name' => 'سورة التحريم',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            258 => 
            array (
                'id' => 259,
                'question' => 'قُلْ أَرَأَيْتُمْ إِنْ أَهْلَكَنِيَ اللَّهُ وَمَن مَّعِيَ أَوْ رَحِمَنَا فَمَن يُجِيرُ الْكَافِرِينَ مِنْ عَذَابٍ أَلِيمٍ',
                'name' => 'سورة الملك',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            259 => 
            array (
                'id' => 260,
                'question' => 'وَيَقُولُونَ مَتَى هَذَا الْوَعْدُ إِن كُنتُمْ صَادِقِينَ.قُلْ إِنَّمَا الْعِلْمُ عِندَ اللَّهِ وَإِنَّمَا أَنَا نَذِيرٌ مُّبِينٌ
ماهي اسم السوره التي ذكرت بها الايه؟
',
                'name' => 'سورة الملك',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            260 => 
            array (
                'id' => 261,
                'question' => 'إن للمتقين عند ربهم جنات النعيم',
                'name' => 'سورة القلم ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            261 => 
            array (
                'id' => 262,
                'question' => 'واصبر لحكم ربك ولا تكن كصاحب الحوت إذ نادى وهو مكظوم',
                'name' => 'سورة القلم ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            262 => 
            array (
                'id' => 263,
                'question' => 'فاذا نفخ في الصور نفخة واحدة',
                'name' => 'سورة الحاقة ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            263 => 
            array (
                'id' => 264,
                'question' => ' قال تعالي:فلا أقسم بما تبصرون ومالا تبصرون.وَمَا لا تُبْصِرُونَ. ماهي اسم السوره التي ذكرت بها الايه؟
',
                'name' => 'سورة الحاقة ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            264 => 
            array (
                'id' => 265,
                'question' => 'فَذَرْهُمْ يَخُوضُوا وَيَلْعَبُوا حَتَّى يُلاقُوا يَوْمَهُمُ الَّذِي يُوعَدُونَ',
                'name' => 'سورة المعارج',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            265 => 
            array (
                'id' => 266,
                'question' => 'فلا أقسم برب المشارق والمغارب إنا لقادرون',
                'name' => 'سورة المعارج',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            266 => 
            array (
                'id' => 267,
                'question' => 'أَلَمْ تَرَوْا كَيْفَ خَلَقَ اللَّهُ سَبْعَ سَمَاوَاتٍ طِبَاقًا',
                'name' => 'سورة نوح ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            267 => 
            array (
                'id' => 268,
                'question' => 'وقال نوح ربي لا تذر على الارض من الكافرين ديارا',
                'name' => 'سورة نوح ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            268 => 
            array (
                'id' => 269,
                'question' => 'وَأَنَّا ظَنَنَّا أَن لَّن تَقُولَ الإِنسُ وَالْجِنُّ عَلَى اللَّهِ كَذِبًا',
                'name' => 'سورة الجن',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            269 => 
            array (
                'id' => 270,
                'question' => 'وأن المساجد لله فلا تدعوا مع الله أحدا',
                'name' => 'سورة الجن',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            270 => 
            array (
                'id' => 271,
                'question' => 'واذكر اسم ربك وتبتل إليه تبتيلا',
                'name' => 'سورة المزمل',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            271 => 
            array (
                'id' => 272,
                'question' => 'ان هذه تذكره فمن شاء اتخذ الى ربه سبيلا',
                'name' => 'سورة المزمل',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            272 => 
            array (
                'id' => 273,
                'question' => 'كَلاَّ إِنَّهُ كَانَ لِآيَاتِنَا عَنِيدًا',
                'name' => 'سورة المدثر ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            273 => 
            array (
                'id' => 274,
                'question' => 'كل نفس بما كسبت رهينة',
                'name' => 'سورة المدثر ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            274 => 
            array (
                'id' => 275,
                'question' => 'يسئل أيان يوم القيامه',
                'name' => 'سورة القيامة',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            275 => 
            array (
                'id' => 276,
                'question' => 'كلا إذا بلغت التراقي',
                'name' => 'سورة القيامة',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            276 => 
            array (
                'id' => 277,
                'question' => 'إن الأبرار يشربون من كأس كان مزاجها كافورا',
                'name' => 'سورة الانسان ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            277 => 
            array (
                'id' => 278,
                'question' => 'واذكر اسم ربك بكرة وأصيلا',
                'name' => 'سورة الانسان ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            278 => 
            array (
                'id' => 279,
                'question' => 'هَذَا يَوْمُ الْفَصْلِ جَمَعْنَاكُمْ وَالأَوَّلِينَ',
                'name' => 'سورة المرسلات ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            279 => 
            array (
                'id' => 280,
                'question' => 'ألم نجعل الارض كفاتا',
                'name' => 'سورة المرسلات ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            280 => 
            array (
                'id' => 281,
                'question' => 'ان المتقين في ظلال وعيون',
                'name' => 'سورة المرسلات ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            281 => 
            array (
                'id' => 282,
                'question' => 'إن يوم الفصل كان ميقاتا',
                'name' => 'سورة ألنبأ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            282 => 
            array (
                'id' => 283,
                'question' => 'إن للمتقين مفازا',
                'name' => 'سورة ألنبأ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            283 => 
            array (
                'id' => 284,
                'question' => 'إِذْ نَادَاهُ رَبُّهُ بِالْوَادِ الْمُقَدَّسِ طُوًى',
                'name' => 'سورة النازعات ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            284 => 
            array (
                'id' => 285,
                'question' => 'إن في ذلك لعبرة لمن يخشي',
                'name' => 'سورة النازعات ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            285 => 
            array (
                'id' => 286,
                'question' => 'كلا انها تذكرة.فمن شاء ذكره',
                'name' => 'سورة عبس',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            286 => 
            array (
                'id' => 287,
                'question' => 'فَإِذَا جَاءَتِ الصَّاخَّةُ',
                'name' => 'سورة عبس',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            287 => 
            array (
                'id' => 288,
                'question' => 'وَإِذَا النُّجُومُ انكَدَرَتْ',
                'name' => 'سورة التكوير',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            288 => 
            array (
                'id' => 289,
                'question' => 'فلا أقسم بالخنس',
                'name' => 'سورة التكوير',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            289 => 
            array (
                'id' => 290,
                'question' => 'إِنَّ الأَبْرَارَ لَفِي نَعِيمٍ',
                'name' => 'سورة الانفطار ',
                'category_id' => 1,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:20:57',
            ),
            290 => 
            array (
                'id' => 291,
                'question' => 'إذا كانت السرعة المتوسطة للسيارة هي 60 كيلومترًا في الساعة وأردت السفر مسافة 240 كيلومترًا، فكم من الوقت سيستغرق السفر؟
',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            291 => 
            array (
                'id' => 292,
                'question' => 'إذا كان 3 أرباع الساعة يساوي 45 دقيقة، فكم تساوي نصف الساعة؟
',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            292 => 
            array (
                'id' => 293,
                'question' => 'ما هي أكبر قارة في العالم؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            293 => 
            array (
                'id' => 294,
                'question' => 'من هو مخترع الإنترنت؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            294 => 
            array (
                'id' => 295,
                'question' => 'ما هو الحيوان الذي يشتهر بالشحم؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            295 => 
            array (
                'id' => 296,
                'question' => 'ما هو اسم أطول نهر في العالم؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            296 => 
            array (
                'id' => 297,
                'question' => 'من هو الشخص الذي صاغ مفهوم النسبية الخاصة؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            297 => 
            array (
                'id' => 298,
                'question' => 'ما هو اسم الكاتب الأمريكي الذي اشتهر بكتابة رواية "The Great Gatsby"؟
',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            298 => 
            array (
                'id' => 299,
                'question' => 'من هو الشخص الذي اخترع الطائرة الأولى في التاريخ؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            299 => 
            array (
                'id' => 300,
                'question' => 'ما هو الكوكب الذي يسمى الكوكب الأحمر؟
',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            300 => 
            array (
                'id' => 301,
                'question' => 'من هو العالم الفرنسي الذي ابتكر علم الكيمياء الحديث؟
',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            301 => 
            array (
                'id' => 302,
                'question' => 'ما هو الجبل الذي يقع في الحدود بين نيبال والصين ويعد أعلى قمة في العالم؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            302 => 
            array (
                'id' => 303,
                'question' => 'ما هو النهر الذي يمر بالعاصمة الفرنسية باريس؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            303 => 
            array (
                'id' => 304,
                'question' => 'ما هي عاصمة تايلاند؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            304 => 
            array (
                'id' => 305,
                'question' => 'ما هو العنصر الذي يشكل أكثر من نصف وزن الأرض؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            305 => 
            array (
                'id' => 306,
                'question' => 'من هي الشخصية التي قادت حملة مصر العسكرية الشهيرة؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            306 => 
            array (
                'id' => 307,
                'question' => 'ما هي عاصمة كندا؟
',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            307 => 
            array (
                'id' => 308,
                'question' => 'ما هو اسم المدينة التي يعتبرها الأتراك العاصمة الثقافية للبلاد؟
',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            308 => 
            array (
                'id' => 309,
                'question' => 'من هي الشخصية التي اخترعت الهاتف؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            309 => 
            array (
                'id' => 310,
                'question' => 'ما هي عاصمة روسيا؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            310 => 
            array (
                'id' => 311,
                'question' => 'ما هي عاصمة المانيا؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            311 => 
            array (
                'id' => 312,
                'question' => 'ما هي الحرب التي شنها العراق ضد إيران في الفترة من 1980 إلى 1988؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            312 => 
            array (
                'id' => 313,
                'question' => 'ما هو الجزء الأكبر من جسم الإنسان؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            313 => 
            array (
                'id' => 314,
                'question' => 'ما هو الغاز المستخدم في اطفاء الحرائق ؟
',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            314 => 
            array (
                'id' => 315,
                'question' => 'ما هو أذكى الحيوانات في العالم',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            315 => 
            array (
                'id' => 316,
                'question' => 'ما هي المادة التي تُشكّل 80% من حجم دماغ الإنسان؟
',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            316 => 
            array (
                'id' => 317,
                'question' => 'ما هو شكل مجرة درب التبانة؟
',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            317 => 
            array (
                'id' => 318,
                'question' => 'من هو القائد الإسلامي الذي انتصر على التتار والمغول وهزم هولاكو؟ ',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            318 => 
            array (
                'id' => 319,
                'question' => 'ما هو ناتج العملية الحسابية 12÷6×3÷2 =؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            319 => 
            array (
                'id' => 320,
                'question' => 'في أنف الإنسان يوجد ما يسمي بالجيوب الأنفية فما عدد هذه الجيوب ؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            320 => 
            array (
                'id' => 321,
                'question' => 'من كم لاعب يتكون فريق كرة السلة ؟
',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            321 => 
            array (
                'id' => 322,
                'question' => 'أين افتتح أول متحف في العالم ؟
',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            322 => 
            array (
                'id' => 323,
                'question' => 'ما هو أثقل الحيوانات الموجودة على كوكب الأرض ؟
',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            323 => 
            array (
                'id' => 324,
                'question' => 'كم يمتلك الأخطبوط من القلوب؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            324 => 
            array (
                'id' => 325,
                'question' => 'ما هي اقوي عضلة في جسم الانسان ؟',
                'name' => 'سؤال ثقافي',
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:23:00',
            ),
            325 => 
            array (
                'id' => 326,
                'question' => 'يا أيها النبي اتق الله ولا تطع الكافرين والمنافقين إن الله كان عليمًا حكيمًا',
                'name' => 'سورة الاحزاب',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            326 => 
            array (
                'id' => 327,
                'question' => 'وَإِذْ قِيلَ لَهُمُ اسْكُنُوا هَٰذِهِ الْقَرْيَةَ وَكُلُوا مِنْهَا حَيْثُ شِئْتُمْ وَقُولُوا حِطَّةٌ وَادْخُلُوا الْبَابَ سُجَّدًا نَّغْفِرْ لَكُمْ خَطِيئَاتِكُمْ ۚ سَنَزِيدُ الْمُحْسِنِينَ. اذكر اسم السوره.',
                'name' => 'سورة الاعراف',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            327 => 
            array (
                'id' => 328,
                'question' => 'وَإِذْ قُلْنَا ادْخُلُوا هَذِهِ الْقَرْيَةَ فَكُلُوا مِنْهَا حَيْثُ شِئْتُمْ رَغَدًا وَادْخُلُوا الْبَابَ سُجَّدًا وَقُولُوا حِطَّةٌ نَغْفِرْ لَكُمْ خَطَايَاكُمْ وَسَنَزِيدُ الْمُحْسِنِينَ. اذكر اسم السوره.',
                'name' => 'سورة البقرة',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            328 => 
            array (
                'id' => 329,
                'question' => 'بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ ۖ وَإِذَا قَضَىٰ أَمْرًا فَإِنَّمَا يَقُولُ لَهُ كُن فَيَكُونُ. اذكر اسم السوره.',
                'name' => 'سورة البقرة',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            329 => 
            array (
                'id' => 330,
                'question' => 'بَدِيعُ السَّمَاوَاتِ وَالأَرْضِ أَنَّى يَكُونُ لَهُ وَلَدٌ وَلَمْ تَكُنْ لَهُ صَاحِبَة. اذكر اسم السوره.',
                'name' => 'سورة الانعام',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            330 => 
            array (
                'id' => 331,
                'question' => 'إن الذين آمنوا والذين هادوا والنصارى والصابئين من آمن بالله واليوم الآخر وعمل صالحا. اذكر اسم السوره.',
                'name' => 'سورة البقرة',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            331 => 
            array (
                'id' => 332,
                'question' => 'إِنَّ الَّذِينَ آمَنُوا وَاَلَّذِينَ هَادُوا وَالصَّابِئُونَ وَالنَّصَارَى مَنْ آمَنَ بِاَللَّهِ وَالْيَوْم الْآخِر. اذكر اسم السوره.',
                'name' => 'سورة المائده',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            332 => 
            array (
                'id' => 333,
                'question' => 'إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالصَّابِئِينَ وَالنَّصَارَىٰ وَالْمَجُوسَ وَالَّذِينَ أَشْرَكُوا إِنَّ اللَّهَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ شَهِيد. ٌاذكر اسم السوره.',
                'name' => 'سورة الحج',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            333 => 
            array (
                'id' => 334,
                'question' => 'يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ. اذكر اسم السوره.',
                'name' => 'سورة النساء',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            334 => 
            array (
                'id' => 335,
                'question' => 'قُلْ يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ غَيْرَ الْحَقِّ.اسم السوره.',
                'name' => 'سورة المائدة',
                'category_id' => 5,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            335 => 
            array (
                'id' => 336,
                'question' => 'وَيَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ وَيَقُولُونَ هَٰؤُلَاءِ شُفَعَاؤُنَا عِندَ اللَّهِ ۚ ',
                'name' => 'سورة يونس',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            336 => 
            array (
                'id' => 337,
                'question' => 'وَيَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَا يَمْلِكُ لَهُمْ رِزْقًا مِّنَ السَّمَاوَاتِ وَالْأَرْضِ شَيْئًا وَلَا يَسْتَطِيعُونَ',
                'name' => 'سورة النحل',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            337 => 
            array (
                'id' => 338,
                'question' => 'وَيَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَا يَنفَعُهُمْ وَلَا يَضُرُّهُمْ',
                'name' => 'سورة الفرقان',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            338 => 
            array (
                'id' => 339,
                'question' => 'وَيَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَمْ يُنَزِّلْ بِهِ سُلْطَانًا وَمَا لَيْسَ لَهُم بِهِ عِلْمٌ ۗ وَمَا لِلظَّالِمِينَ مِن نَّصِير',
                'name' => 'سورة الحج',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            339 => 
            array (
                'id' => 340,
                'question' => 'وَمَن يَهْدِ اللَّهُ فَهُوَ الْمُهْتَدِ ۖ وَمَن يُضْلِلْ فَلَن تَجِدَ لَهُمْ أَوْلِيَاءَ مِن دُونِهِ',
                'name' => 'سورة الإسراء',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            340 => 
            array (
                'id' => 341,
                'question' => 'مَن يَهْدِ اللَّهُ فَهُوَ الْمُهْتَدِ وَمَن يُضْلِلْ فَلَن تَجِدَ لَهُ وَلِيًّا مُّرْشِدًا',
                'name' => 'سورة الكهف',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            341 => 
            array (
                'id' => 342,
                'question' => 'إِنَّ السَّاعَةَ آتِيَةٌ أَكَادُ أُخْفِيهَا لِتُجْزَىٰ كُلُّ نَفْسٍ بِمَا تَسْعَىٰ',
                'name' => 'سورة طه',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            342 => 
            array (
                'id' => 343,
                'question' => 'إِنَّ السَّاعَة لَآتِيَة لَا رَيْب فِيهَا وَلَكِنَّ أَكْثَر النَّاس لَا يُؤْمِنُونَ',
                'name' => 'سورة غافر',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            343 => 
            array (
                'id' => 344,
                'question' => 'وَإِنَّ السَّاعَةَ لآتِيَةٌ فَاصْفَحِ الصَّفْحَ الْجَمِيلَ',
                'name' => 'سورة الحجر',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            344 => 
            array (
                'id' => 345,
                'question' => 'وَمَنْ أَظْلَمُ مِمَّن ذُكِّرَ بِآيَاتِ رَبِّهِ ثُمَّ أَعْرَضَ عَنْهَا',
                'name' => 'سورة السجده',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            345 => 
            array (
                'id' => 346,
                'question' => 'وَمَنْ أَظْلَمُ مِمَّن ذُكِّرَ بِآيَاتِ رَبِّهِ فَأَعْرَضَ عَنْهَا',
                'name' => 'سورة الكهف',
                'category_id' => 3,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            346 => 
            array (
                'id' => 347,
                'question' => 'قَالَ إِنَّمَا الْعِلْمُ عِندَ اللَّهِ وَأُبَلِّغُكُم مَّا أُرْسِلْتُ بِهِ',
                'name' => 'سورة الأحقاف',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            347 => 
            array (
                'id' => 348,
                'question' => 'قُلْ إِنَّمَا الْعِلْمُ عِندَ اللَّهِ وَإِنَّمَا أَنَا نَذِيرٌ مُّبِينٌ

',
                'name' => 'سورة الملك',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            348 => 
            array (
                'id' => 349,
                'question' => 'إِنَّ الْمُتَّقِينَ فِي مَقَامٍ أَمِينٍ



',
                'name' => 'سورة الدخان',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            349 => 
            array (
                'id' => 350,
                'question' => 'إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَعُيُونٍ آخِذِينَ مَا آتَاهُمْ رَبُّهُمْ ۚ إِنَّهُمْ كَانُوا قَبْلَ ذَٰلِكَ مُحْسِنِينَ',
                'name' => 'سورة الذاريات',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            350 => 
            array (
                'id' => 351,
                'question' => 'إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَنَعِيمٍ.فَاكِهِينَ بِمَا آتَاهُمْ رَبُّهُمْ وَوَقَاهُمْ رَبُّهُمْ عَذَابَ الْجَحِيمِ
',
                'name' => 'سورة الطور',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            351 => 
            array (
                'id' => 352,
                'question' => 'إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَنَهَرٍ


',
                'name' => 'سورة القمر',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            352 => 
            array (
                'id' => 353,
                'question' => 'إِنَّ الْمُتَّقِينَ فِي ظِلَالٍ وَعُيُونٍ



',
                'name' => 'سورة المرسلات',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            353 => 
            array (
                'id' => 354,
                'question' => 'إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَعُيُونٍ.ادْخُلُوهَا بِسَلَامٍ آمِنِينَ

',
                'name' => 'سورة الحجر',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            354 => 
            array (
                'id' => 355,
                'question' => 'مُتَّكِئِينَ فِيهَا يَدْعُونَ فِيهَا بِفَاكِهَةٍ كَثِيرَةٍ وَشَرَابٍ

',
                'name' => 'سورة ص',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            355 => 
            array (
                'id' => 356,
                'question' => 'مُتَّكِئِينَ عَلَيْهَا مُتَقَابِلِينَ



',
                'name' => 'سورة الواقعه',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            356 => 
            array (
                'id' => 357,
                'question' => 'مُتَّكِئِينَ فِيهَا عَلَى الْأَرَائِكِ ۖ لَا يَرَوْنَ فِيهَا شَمْسًا وَلَا زَمْهَرِيرًا
',
                'name' => 'سورة الانسان',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            357 => 
            array (
                'id' => 358,
                'question' => 'مُتَّكِئِينَ عَلَىٰ سُرُرٍ مَصْفُوفَةٍ ۖ وَزَوَّجْنَاهُمْ بِحُورٍ عِينٍ



',
                'name' => 'سورة الطور',
                'category_id' => 4,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            358 => 
            array (
                'id' => 359,
                'question' => 'اللَّهُ الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ',
                'name' => 'سورة الطلاق',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            359 => 
            array (
                'id' => 360,
                'question' => 'الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ طِبَاقًا',
                'name' => 'سورة الملك',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            360 => 
            array (
                'id' => 361,
                'question' => 'خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ ',
                'name' => 'سورة التغابن',
                'category_id' => 2,
                'answer' => NULL,
                'created_at' => NULL,
                'updated_at' => '2024-02-16 14:22:29',
            ),
            361 => 
            array (
                'id' => 367,
                'question' => 'skafy',
                'name' => NULL,
                'category_id' => 6,
                'answer' => NULL,
                'created_at' => '2024-02-23 18:10:48',
                'updated_at' => '2024-02-23 18:10:48',
            ),
        ));
        
        
    }
}